Repository: 4d/4D-NetKit
Catalog: Resources/*.lproj/NetKitPT.xlf
Languages: pt

# ERR_4DNK_1
source: Undefined or null parameters object.
pt: Parâmetro Objeto null ou indefinido.

# ERR_4DNK_2
source: "{attribute}" attribute is not defined or is empty.
pt: O atributo "{attribute}" não está definido ou está vazio.

# ERR_4DNK_3
source: Unsupported value in "{attribute}" attribute.
pt: Valor sem suporte no atributo "{attribute}".

# ERR_4DNK_4
source: The authorization code was not received within the time limit (timeout error).
pt: O pedido 'GetToken' retornou uma resposta vazia.

# ERR_4DNK_5
source: 'GetToken' request returned an unexpected status code (received: {received} expected: {expected}).
pt: O pedido 'GetToken' devolveu um código de status inesperado (recebido: {received} esperado: {expected}).

# ERR_4DNK_6
source: 'GetToken' request returned an empty 'authorizationCode'.
pt: O pedido 'GetToken' devolveu um 'authorizationCode' vazio.

# ERR_4DNK_7
source: The port {port} is already used.
pt: A porta {port} já está em uso.

# ERR_4DNK_8
source: Request returned an unexpected response ({status} {explanation}: {message}).
pt: A solicitação retornou uma resposta inesperada ({status} {explanation}: {message}).

# ERR_4DNK_9
source: Undefined or empty parameter {which} in function {function}.
pt: O parâmetro {which} na função {function} está vazio ou indefinido.

# ERR_4DNK_10
source: Unsupported parameter type {which} in function {function}.
pt: O tipo do parâmetro {which} na função {function} não é suportado.

# ERR_4DNK_11
source: You have reached the limit of the number of requests per minute that 4D can serve without a license.
pt: Atingiu o limite de solicitações por minuto que o 4D pode atender sem licença.

# ERR_4DNK_12
source: The '{function}' function returned an unexpected error : {message}.
pt: A função '{function}' retornou um erro inesperado: {message}.

# OAuth2_Response_Message
source: Verification code received
pt: Código de verificação recebido

# OAuth2_Error_Message
source: Undefined error
pt: Erro indefinido

# OAuth2_Response_Details
source: You may now close this window
pt: Agora você pode fechar esta janela

# List_No_Next_Page
source: No next page.
pt: Não é próxima página.

# List_No_Previous_Page
source: No previous page.
pt: Nenhuma página anterior.
