Repository: 4d/4D-NetKit
Catalog: Resources/*.lproj/NetKitDE.xlf
Languages: de

# ERR_4DNK_1
source: Undefined or null parameters object.
de: Undefiniert oder Null Parameter Object.

# ERR_4DNK_2
source: "{attribute}" attribute is not defined or is empty.
de: "{attribute}" Attribute ist nicht definiert oder leer.

# ERR_4DNK_3
source: Unsupported value in "permission" attribute.
de: Nicht unterstützter Wert in Attribut "{attribute}".

# ERR_4DNK_4
source: "authorizationCode" attribute is empty.
de: 'GetToken' Anfrage hat eine leere Antwort zurückgeliefert.

# ERR_4DNK_5
source: 'GetToken' request returned an unexpected status code (received: {received} expected: {expected}).
de: 'GetToken' Anfrage hat einen unerwarteteten Statuscode zurückgeliefert (erhalten: {received} erwartet: {expected}).

# ERR_4DNK_6
source: 'GetToken' request returned an empty 'authorizationCode'
de: 'GetToken' Anfrage hat einen leeren 'authorizationCode' zurückgeliefert

# ERR_4DNK_7
source: The port {port} is already used.
de: Der Port {port} wird bereits verwendet.

# ERR_4DNK_8
source: Request returned an unexpected response ({status} {explanation}: {message}).
de: Anfrage hat eine unerwartete Antwort erhalten ({status} {explanation}: {message}).

# ERR_4DNK_9
source: Undefined or empty parameter {which} in function {function}.
de: Undefinierter oder leerer Parameter {which} in Funktion {function}.

# ERR_4DNK_10
source: Unsupported parameter type {which} in function {function}.
de: Nicht unterstützter Parametertyp {which} in Funktion {function}.

# ERR_4DNK_11
source: You have reached the limit of the number of requests per minute that 4D can serve without a license.
de: Sie haben die maximaler Anzahl Anfragen pro Minute erreicht, die 4D ohne Lizenz bedienen kann.

# ERR_4DNK_12
source: The '{function}' function returned an unexpected error : {message}.
de: Die Funktion '{function}' hat einen unerwarteten Fehler zurückgegeben : {message}.

# ERR_4DNK_13
source: The '{which}' parameter value in function {function} is too large and must not exceed {max}.
de: Der '{which}'-Parameterwert in der Funktion {function} ist zu groß und darf {max} nicht überschreiten.

# OAuth2_Response_Message
source: Verification code received
de: Überprüfungscode erhalten

# OAuth2_Error_Message
source: Undefined error
de: Unbekannter Fehler

# OAuth2_Response_Details
source: You may now close this window
de: Sie können dieses Fenster nun schließen

# List_No_Next_Page
source: No next page.
de: Keine nächste Seite.

# List_No_Previous_Page
source: No previous page.
de: Keine vorherige Seite.
