Repository: 4d/4D-NetKit
Catalog: Resources/*.lproj/NetKitES.xlf
Languages: es

# ERR_4DNK_1
source: Undefined or null parameters object.
es: Parámetro Objeto null o indefinido.

# ERR_4DNK_2
source: "{attribute}" attribute is not defined or is empty.
es: El atributo "{attribute}" no está definido o está vacío.

# ERR_4DNK_3
source: Unsupported value in "{attribute}" attribute.
es: Valor no soportado en el atributo "{attribute}".

# ERR_4DNK_4
source: The authorization code was not received within the time limit (timeout error).
es: La petición 'GetToken' devolvió una respuesta vacía.

# ERR_4DNK_5
source: 'GetToken' request returned an unexpected status code (received: {received} expected: {expected}).
es: La petición 'GetToken' devolvió un código de estado inesperado (recibido: {received} esperado: {expected}).

# ERR_4DNK_6
source: 'GetToken' request returned an empty 'authorizationCode'.
es: La petición 'GetToken' devolvió un 'authorizationCode' vacío.

# ERR_4DNK_7
source: The port {port} is already used.
es: El puerto {port} ya está en uso.

# ERR_4DNK_8
source: Request returned an unexpected response ({status} {explanation}: {message}).
es: La petición devolvió una respuesta inesperada ({status} {explanation}: {message}).

# ERR_4DNK_9
source: Undefined or empty parameter {which} in function {function}.
es: El parámetro {which} en la función {function} está vacío o sin definir.

# ERR_4DNK_10
source: Unsupported parameter type {which} in function {function}.
es: No se soporta el tipo del parámetro {which} en la función {function}.

# ERR_4DNK_11
source: You have reached the limit of the number of requests per minute that 4D can serve without a license.
es: Llegó al límite de peticiones por minuto que 4D puede atender sin licencia.

# ERR_4DNK_12
source: The '{function}' function returned an unexpected error : {message}.
es: La función '{function}' devolvió un error inesperado: {message}.

# OAuth2_Response_Message
source: Verification code received
es: Código de verificación recibido

# OAuth2_Error_Message
source: Undefined error
es: Error indefinido

# OAuth2_Response_Details
source: You may now close this window
es: Ahora puede cerrar esta ventana

# List_No_Next_Page
source: No next page.
es: No hay página siguiente.

# List_No_Previous_Page
source: No previous page.
es: No hay página anterior.
