Repository: 4d/4D-NetKit
Catalog: Resources/*.lproj/NetKitFR.xlf
Languages: fr

# ERR_4DNK_1
source: Undefined or null parameters object.
fr: Paramètre Objet null ou indéfini.

# ERR_4DNK_2
source: "{attribute}" attribute is not defined or is empty.
fr: L'attribut "{attribute}" n'est pas défini ou est vide.

# ERR_4DNK_3
source: Unsupported value in "{attribute}" attribute.
fr: Valeur non supportée dans l'attribut "{attribute}".

# ERR_4DNK_4
source: The authorization code was not received within the time limit (timeout error).
fr: Le code d'autorisation n'as pas été reçu dans le temps imparti (erreur de timeout).

# ERR_4DNK_5
source: 'GetToken' request returned an unexpected status code (received: {received} expected: {expected}).
fr: La requête 'GetToken' a retourné un code de statut inattendu (reçu: {received} attendu: {expected}).

# ERR_4DNK_6
source: 'GetToken' request returned an empty 'authorizationCode'.
fr: La requête 'GetToken' a retourné un 'authorizationCode' vide.

# ERR_4DNK_7
source: The port {port} is already used.
fr: Le port {port} est déjà utilisé.

# ERR_4DNK_8
source: Request returned an unexpected response ({status} {explanation}: {message}).
fr: La requête a retourné une réponse inattendue ({status} {explanation}: {message}).

# ERR_4DNK_9
source: Undefined or empty parameter {which} in function {function}.
fr: Le paramètre {which} dans la fonction {function} est vide ou indéfini.

# ERR_4DNK_10
source: Unsupported parameter type {which} in function {function}.
fr: Le type du paramètre {which} dans la fonction {function} n'est pas supporté.

# ERR_4DNK_11
source: You have reached the limit of the number of requests per minute that 4D can serve without a license.
fr: Vous avez atteint la limite du nombre de requêtes par minute que 4D peut servir sans licence.

# ERR_4DNK_12
source: The '{function}' function returned an unexpected error : {message}.
fr: La fonction '{function}' a retourné une erreur inattendue : {message}.

# ERR_4DNK_13
source: The '{which}' parameter value in function {function} is too large and must not exceed {max}.
fr: La valeur du paramètre '{which}' dans la fonction {function} est trop grande et ne doit pas dépasser {max}.

# OAuth2_Response_Title
source: Composant 4D NetKit
fr: 4D NetKit Component

# OAuth2_Response_Message
source: Verification code received
fr: Code de vérification reçu

# OAuth2_Error_Message
source: Undefined error
fr: Erreur indéfinie

# OAuth2_Response_Details
source: You may now close this window
fr: Vous pouvez maintenant fermer la fenêtre

# List_No_Next_Page
source: No next page.
fr: Pas de page suivante.

# List_No_Previous_Page
source: No previous page.
fr: Pas de page précédente.
