Repository: 4d/4D-NetKit
Catalog: Resources/*.lproj/OAuth2FR.xlf
Languages: fr

# OAuth2_Undefined_parameters
source: Undefined or null parameters object.
fr: Objet paramêtre null ou indéfini.

# OAuth2_Unsupported_provider
source: Unsupported provider in "provider" attribute.
fr: Fournisseur non supporté dans l'attribut "provider".

# OAuth2_Unsupported_permission
source: Unsupported value in "permission" attribute.
fr: Valeur non supportée dans l'attribut "permission".

# OAuth2_Empty_authorizationCode
source: "authorizationCode" attribute is empty.
fr: L'attribut "authorizationCode" est vide.

# OAuth2_Undefined_provider
source: "provider" attribute is not defined or is empty.
fr: L'attribut "provider" n'est pas défini, ou est vide.

# OAuth2_Undefined_clientId
source: "clientId" attribute is not defined or is empty.
fr: L'attribut "clientId" n'est pas défini, ou est vide.

# OAuth2_Undefined_authenticateURI
source: "authenticateURI" attribute is not defined or is empty.
fr: L'attribut "authenticateURI" n'est pas défini, ou est vide.

# OAuth2_Undefined_redirectURI
source: "redirectURI" attribute is not defined or is empty.
fr: L'attribut "redirectURI" n'est pas défini, ou est vide.

# OAuth2_Undefined_tokenURI
source: "tokenURI" attribute is not defined or is empty.
fr: L'attribut "tokenURI" n'est pas défini, ou est vide.

# OAuth2_Undefined_scope
source: "scope" attribute is not defined or is empty.
fr: L'attribut "scope" n'est pas défini, ou est vide.

# OAuth2_Undefined_permission
source: "permission" attribute is not defined or is empty.
fr: L'attribut "permission" n'est pas défini, ou est vide.

# OAuth2_Error_Empty_Token_Response
source: Get Token request returned an empty response.
fr: La requete 'Get Token' retourne une réponse vide.

# OAuth2_Response_Title
source: Composant OAuth2
fr: OAuth2 Component

# OAuth2_Response_Message
source: Verification code received
fr: Code de vérification reçu

# OAuth2_Error_Message
source: Undefined error
fr: Erreure indéfinie

# OAuth2_Response_Details
source: You may now close this window
fr: Vous pouvez maintenant fermer la fenêtre

# OAuth2_Port_Already_Used
source: The port {PORT} is already used.
fr: Le port {PORT} est déjà utilisé.
